Thanks for the additional info.
Copying the exact config which you show here produces the expected result, where adding a new element creates a single new instance and a single new output value. The output you show here doesn't seem to correspond with your description, the first to instances are not present in the state at all, and the plan output only shows 2 values being removed from the config.

For reference, this is the output after adding the 3rd value:
```
Terraform will perform the following actions:

  # module.module.aws_iam_role.name["example_three"] will be created
  + resource "aws_iam_role" "name" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "something_else_again"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ out = {
      + example_three = (known after apply)
        # (2 unchanged attributes hidden)
    }

```

I don't have any other guesses as to what you are doing, but there is always a chance the provider is adding to the confusion here. Removing the AWS provider from the equation should make it easier to narrow down what is going on, making this module easier to work with:

```
locals {
  vpcs = {
    example_one : { name : "something", cidr_block : "some_cidr_block" },
    example_two : { name : "something_else", cidr_block : "some_other_cidr_block" }
    example_three : { name : "something_else_again", cidr_block : "bananaman" } # this is new and was not present in the configuration, which is what is causing the issue.
  }
}

resource "terraform_data" "name" {
  for_each = local.vpcs
  triggers_replace     = each.value.name
}

output "test" {
  value = { for k, v in local.vpcs : k => terraform_data.name[k].id }
  # this would more commonly be written as
  # value = { for k, v in terraform_data.name: k => value.id }
}
```